out/spring.html
<!DOCTYPE html>
<html>
<head>
<title>Spring</title>
<!-- 2017-02-06 周一 10:22 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="imfine">
<link rel="stylesheet" href="nnn.css">
<meta name="viewport" content="width=device-width,initial-scale=1">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Spring</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spring</a></li>
<li><a href="#sec-2">2. Spring MVC</a>
<ul>
<li><a href="#sec-2-1">2.1. 基本步骤</a></li>
</ul>
</li>
</ul>
</div>
</nav>



<section id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Spring</h2>
</section>

<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Spring MVC</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 基本步骤</h3>
<div class="outline-text-3" id="text-2-1">
<p>
第一步，创建 Gradle 项目，在 build.gradle 增加相关依赖
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #228b22;">apply</span> <span style="color: #a0522d;">plugin</span>: <span style="color: #8b2252;">'java'</span>
apply plugin: <span style="color: #8b2252;">'war'</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25351;&#23450; Java &#29256;&#26412;</span>
sourceCompatibility = 1.7

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622;&#19979;&#36733; jar &#21253;&#30340;&#22320;&#22336;</span>
repositories <span style="color: #707183;">{</span>
  jcenter<span style="color: #7388d6;">()</span>
<span style="color: #707183;">}</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622;&#38656;&#35201;&#30340; jar &#21253;&#20381;&#36182;</span>
dependencies <span style="color: #707183;">{</span>

  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#23450;&#20041;&#20004;&#20010;&#23616;&#37096;&#21464;&#37327;</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#37324;&#20195;&#34920;&#25105;&#20204;&#38656;&#35201;&#30340; hibernate &#21644; spring &#30340;&#29256;&#26412;</span>
  <span style="color: #228b22;">def</span> <span style="color: #a0522d;">hibernateVersion</span> = <span style="color: #8b2252;">"5.1.0.Final"</span>
  def springVersion = <span style="color: #8b2252;">"4.3.5.RELEASE"</span>

  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#22312; test &#20013;&#38656;&#35201;&#29992;&#21040;&#30340; jar &#21253;</span>
  testCompile <span style="color: #7388d6;">(</span>
    <span style="color: #8b2252;">"junit:junit:4.12"</span>
  <span style="color: #7388d6;">)</span>

  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#25351;&#26126; Tomcat &#19978;&#24050;&#32463;&#33258;&#24102;&#30340; jar &#21253;&#65292;&#36825;&#26679;&#21457;&#24067;&#30340;&#26102;&#20505;&#25165;&#19981;&#20250;&#37325;&#22797;</span>
  providedCompile <span style="color: #7388d6;">(</span>
    <span style="color: #8b2252;">"javax:javaee-web-api:7.0"</span>,
  <span style="color: #7388d6;">)</span>

  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622;&#25105;&#20204;&#39033;&#30446;&#38656;&#35201;&#29992;&#21040;&#30340;&#25152;&#26377; jar &#21253;&#65292;&#21363; compile &#29615;&#33410;&#38656;&#35201;&#30340; jar &#21253;</span>
  compile <span style="color: #7388d6;">(</span>

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#26412;&#22320;&#30340; OJDBC &#21253;&#21152;&#20837;&#36827;&#26469;</span>
    files<span style="color: #909183;">(</span><span style="color: #8b2252;">"E:/SSH/lib_hibernate/ojdbc7.jar"</span><span style="color: #909183;">)</span>,

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#29992;&#26469;&#31649;&#29702;&#25968;&#25454;&#28304;&#30340;&#30693;&#21517; jar &#21253;</span>
    <span style="color: #8b2252;">"c3p0:c3p0:0.9.1.2"</span>,

    <span style="color: #b22222;">// </span><span style="color: #b22222;">jsp &#20013; jstl &#26631;&#31614;&#30340;&#25903;&#25345; jar &#21253;</span>
    <span style="color: #8b2252;">"javax.servlet:jstl:1.2"</span>,

    <span style="color: #b22222;">// </span><span style="color: #b22222;">log4j &#26085;&#24535;&#25903;&#25345;&#30340; jar &#21253;</span>
    <span style="color: #8b2252;">"log4j:log4j:1.2.17"</span>,

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622; hibernate</span>
    <span style="color: #8b2252;">"org.hibernate:hibernate-core:$hibernateVersion"</span>,

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622; spring</span>
    <span style="color: #8b2252;">"org.springframework:spring-web:$springVersion"</span>,
    <span style="color: #8b2252;">"org.springframework:spring-orm:$springVersion"</span>,
    <span style="color: #8b2252;">"org.springframework:spring-webmvc:$springVersion"</span>,
    <span style="color: #8b2252;">"com.fasterxml.jackson.core:jackson-databind:2.5.1"</span>
  <span style="color: #7388d6;">)</span>
<span style="color: #707183;">}</span>


<span style="color: #b22222;">// </span><span style="color: #b22222;">&#20026;&#32534;&#35793;&#22120;&#37197;&#32622;&#32534;&#30721;&#65292;&#38450;&#27490;&#26576;&#20123;&#24773;&#20917;&#19979;&#32534;&#35793;&#20986;&#29616;&#20081;&#30721;&#30340;&#24773;&#20917;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#30456;&#24212;&#30340;&#65292;&#25105;&#20204;&#25152;&#26377;&#30340;&#20195;&#30721;&#24212;&#35813;&#20445;&#23384;&#25104; UTF-8 &#26684;&#24335;</span>
tasks.<span style="color: #0000ff;">withType</span><span style="color: #707183;">(</span><span style="color: #228b22;">JavaCompile</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  options.encoding = <span style="color: #8b2252;">"UTF-8"</span>
<span style="color: #707183;">}</span>


<span style="color: #b22222;">// </span><span style="color: #b22222;">&#33258;&#23450;&#20041;&#20219;&#21153;&#65292;&#23558;&#24037;&#31243;&#25152;&#38656;&#35201;&#30340; jar &#21253;&#25335;&#36125;&#21040;&#39033;&#30446;&#19979;&#30340; lib &#25991;&#20214;&#22841;&#19979;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#38656;&#35201;&#25163;&#21160;&#25191;&#34892;&#36825;&#20010; task &#25165;&#20250;&#26377;&#25928;&#26524;&#12290;&#36825;&#26159;&#20026;&#20102;&#26041;&#20415;&#23548;&#20986; jar &#21253;</span>
<span style="color: #228b22;">task</span> <span style="color: #0000ff;">copyJars</span><span style="color: #707183;">(</span>type: Copy<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#25351;&#26126;&#25105;&#20204;&#23548;&#20986;&#30340;&#26159; compile &#21644; test &#25152;&#20381;&#36182;&#30340; jar &#21253;</span>
  <span style="color: #228b22;">from</span> configurations.<span style="color: #a0522d;">compile</span>, configurations.<span style="color: #228b22;">testCompile</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#25351;&#26126;&#23548;&#20986;&#21040; "lib" &#25991;&#20214;&#22841;&#19979;</span>
  <span style="color: #a0522d;">into</span> <span style="color: #8b2252;">"lib"</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
第二步，配置 web.xml，加入 spring 和 mvc 支持
</p>
<div class="org-src-container">

<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622; spring &#30340; root application context (parent) </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22312; spring mvc &#20013;&#65292;&#36825;&#20010;&#37197;&#32622;&#26159;&#21487;&#36873;&#30340; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22312;&#36825;&#20010; IOC &#23481;&#22120;&#37324;&#65292;&#20027;&#35201;&#37197;&#32622;&#19968;&#20123;&#20840;&#23616;&#30340;&#19996;&#35199; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#27604;&#22914; dao/service &#30340;&#20381;&#36182;&#65292;&#22768;&#26126;&#24335;&#20107;&#21153;&#20043;&#31867; </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">listener</span>&gt;
  &lt;<span style="color: #0000ff;">listener-class</span>&gt;org.springframework.web.context.ContextLoadListener&lt;/<span style="color: #0000ff;">listener-class</span>&gt;
&lt;/<span style="color: #0000ff;">listener</span>&gt;
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#36335;&#24452;&#65292;&#40664;&#35748;&#26159; "WEB-INF/applicationContext.xml" </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">context-param</span>&gt;
  &lt;<span style="color: #0000ff;">param-name</span>&gt;contextConfigPath&lt;/<span style="color: #0000ff;">param-name</span>&gt;
  &lt;<span style="color: #0000ff;">param-value</span>&gt;classpath:spring-root.xml&lt;/<span style="color: #0000ff;">param-value</span>&gt;
&lt;/<span style="color: #0000ff;">context-param</span>&gt;


<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622; SpringMVC &#30340; DispatcherServlet  context (child) </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#36825;&#20010;&#24517;&#39035;&#35201;&#37197;&#32622;&#65292;&#23427;&#30340;&#29238;&#23481;&#22120;&#26159; &#19978;&#38754;&#30340;&#37027;&#20010; </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">servlet</span>&gt;
  &lt;<span style="color: #0000ff;">servlet-name</span>&gt;miniblog&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
  &lt;<span style="color: #0000ff;">servlet-class</span>&gt;org.springframework.web.servlet.DispatcherServlet&lt;/<span style="color: #0000ff;">servlet-class</span>&gt;
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25351;&#23450;&#37197;&#32622;&#25991;&#20214;&#36335;&#24452;&#65292;&#21487;&#36873; </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#40664;&#35748;&#25991;&#20214;&#26159; "WEB-INF/miniblog-dispatcher.xml" </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">init-param</span>&gt;
    &lt;<span style="color: #0000ff;">param-name</span>&gt;contextConfigLocation&lt;/<span style="color: #0000ff;">param-name</span>&gt;
    &lt;<span style="color: #0000ff;">param-value</span>&gt;classpath:spring-miniblog.xml&lt;/<span style="color: #0000ff;">param-value</span>&gt;
  &lt;/<span style="color: #0000ff;">init-param</span>&gt;
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#21487;&#20197;&#25351;&#23450; tomcat &#21551;&#21160;&#30340;&#26102;&#20505;&#65292;&#33258;&#21160;&#21021;&#22987;&#21270; DispatcherServlet </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22914;&#26524;&#27809;&#26377;&#36825;&#20010;&#37197;&#32622;&#65292;&#20250;&#22312;&#31532;&#19968;&#27425;&#35775;&#38382;&#30340;&#26102;&#20505;&#25165;&#20250;&#21435;&#21019;&#24314; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">load-on-start</span>&gt;1&lt;/<span style="color: #0000ff;">load-on-start</span>&gt;
&lt;/<span style="color: #0000ff;">servlet</span>&gt;
&lt;<span style="color: #0000ff;">servlet-mapping</span>&gt;
  &lt;<span style="color: #0000ff;">servlet-name</span>&gt;miniblog&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
  &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
&lt;/<span style="color: #0000ff;">servlet-mapping</span>&gt;
</pre>
</div>

<p>
第三步，配置 spring 的 context 文件，如 spring-miniblog.xml
</p>
<div class="org-src-container">

<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> mvc &#29256;&#26412;&#30340; context:annotation-driven </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#38024;&#23545; mvc &#22686;&#21152;&#20102;&#19968;&#20123;&#20854;&#20182;&#25903;&#25345;&#65292;&#38656;&#35201;&#24320;&#21551; </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #483d8b;">mvc</span>:<span style="color: #0000ff;">annotation-driven</span> /&gt;

<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#25195;&#25551;&#21457;&#29616;&#25152;&#26377;&#20855;&#26377; @Controller &#27880;&#35299;&#30340;&#31867;&#65292;&#21152;&#36733;&#21040;&#23481;&#22120; </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #483d8b;">context</span>:<span style="color: #0000ff;">component-scan</span> <span style="color: #a0522d;">base-package</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">app.controller</span><span style="color: #8b2252;">"</span> /&gt;

<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#35270;&#22270;&#35299;&#26512;&#22120;&#65292;&#23558; Controller &#36820;&#22238;&#30340;&#23383;&#31526;&#20018;&#32452;&#32455;&#25104;&#20840;&#36335;&#24452; </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">bean</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">viewResolver</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">org.springframework.web.servlet.view.InternalResourceViewResolver</span><span style="color: #8b2252;">"</span>&gt;
  &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">prefix</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">/WEB-INF/view/</span><span style="color: #8b2252;">"</span> /&gt;
  &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">suffix</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">.jsp</span><span style="color: #8b2252;">"</span> /&gt;
&lt;/<span style="color: #0000ff;">bean</span>&gt;

<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#38745;&#24577;&#36164;&#28304;&#30340;&#35775;&#38382;&#26144;&#23556; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#27604;&#22914;&#35775;&#38382; http://localhost/js/jquery.js&#65292;mvc &#23558;&#20250;&#21435;&#23547;&#25214; /assets/javascript/jquery.js </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #483d8b;">mvc</span>:<span style="color: #0000ff;">resource</span> <span style="color: #a0522d;">mapping</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">/js/**</span><span style="color: #8b2252;">"</span>  <span style="color: #a0522d;">location</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">/assets/javascript</span><span style="color: #8b2252;">"</span> /&gt;
&lt;<span style="color: #483d8b;">mvc</span>:<span style="color: #0000ff;">resource</span> <span style="color: #a0522d;">mapping</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">/css/**</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">location</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">/assets/stylesheet</span><span style="color: #8b2252;">"</span> /&gt;
</pre>
</div>

<p>
第四步，建立 Controller，进行测试
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #008b8b;">@Controller</span>
<span style="color: #008b8b;">@RequestMapping</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"/users"</span><span style="color: #707183;">)</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">UserController</span> <span style="color: #707183;">{</span>

    <span style="color: #008b8b;">@RequestMapping</span><span style="color: #7388d6;">(</span><span style="color: #8b2252;">"/{name}"</span><span style="color: #7388d6;">)</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">String</span> <span style="color: #0000ff;">show</span><span style="color: #7388d6;">(</span><span style="color: #008b8b;">@PathVarible</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">name</span>, <span style="color: #228b22;">Model</span> <span style="color: #a0522d;">model</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        model.add<span style="color: #909183;">(</span><span style="color: #8b2252;">"name"</span>, name<span style="color: #909183;">)</span>;
        <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"show"</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: imfine</p>
<p class="date">Created: 2017-02-06 周一 10:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
